package gr.sextreme.main;

import android.os.Bundle;
import android.support.v4.app.Fragment;
import android.text.Html;
import android.view.LayoutInflater;
import android.view.View;
import android.view.ViewGroup;
import android.widget.TextView;

import gr.sextreme.R;

public class KtirioFragment extends Fragment {

    private final String htmlText = "<h2>Η ιστορία του Κτηρίου</strong></h2>\n" +
            "<br />\n" +
            " Το επιβλητικό κτήριο της Βουλής των Ελλήνων έχει μακρά ιστορία που συνδέεται άμεσα με την ιστορία του σύγχρονου ελληνικού κράτους.&nbsp;Αρχικά Ανάκτορα του Όθωνα και του Γεωργίου, μετατράπηκε έναν αιώνα μετά την κατασκευή του σε Κτήριο της Βουλής και της Γερουσίας. Σήμερα είναι η Βουλή των Ελλήνων, ένα διαχρονικό σύμβολο που αποτελεί μέρος της συλλογικής μνήμης. Το ίδιο το Κτήριο στο πέρασμα των χρόνων άλλαξε, προσαρμόστηκε, εκσυγχρονίστηκε.</div>\n" +
            "<br />\n" +
            "<h2>Από το 1836 έως το 1862</strong></h2>\n" +
            "<br />\n" +
            " Ως τοποθεσία ανέγερσης των Ανακτόρων του Όθωνα επιλέχθηκε ο λόφος της Μπουμπουνίστρας. Θέση κομβική, σημείο κεντρικό της νέας πρωτεύουσας, ασφαλές και δροσερό, να αντικρίζει την Ακρόπολη και τις παρυφές της Αθήνας. Η πρόταση προήλθε από τον&nbsp;διευθυντή της Ακαδημίας Καλών Τεχνών του Μονάχου και επίσημο αρχιτέκτονα της βαυαρικής αυλής Φρίντριχ φον Γκαίρτνερ (Friedrich von Gaertner 1791-1847).</div>\n" +
            "<br />\n" +
            " Οι άλλες ιδέες και εισηγήσεις παραμερίστηκαν: του Λέο φον Κλέντσε (Leo von Klenze) για τον Κεραμεικό<strong>,</strong> του &nbsp;Λούντβιχ Λάνγκε (Ludwig Lange) για τους πρόποδες του Λυκαβηττού, του Καρόλου Φρειδερίκου Σίνκελ (Karl Friedrich Schinkel) για την Ακρόπολη και των Σταμάτη Κλεάνθη και Έντουαρντ Σάουμπερτ (Eduard Schaubert) για τη συμβολή των οδών Πειραιώς και Σταδίου, την σημερινή πλατεία Ομονοίας.</div>\n" +
            "<br />\n" +
            " Στις 6 Φεβρουαρίου 1836 τέθηκε ο θεμέλιος λίθος στο υψηλότερο ανατολικό άκρο της πόλης. Τον επόμενο μήνα στην οικοδομή δούλευαν 520 άτομα. Στρατός και τεχνίτες, Γερμανοί αρχιτέκτονες, Γερμανοί, Έλληνες και Ιταλοί μάστορες συνεργάστηκαν στην κατασκευή. Με την ευκαιρία αυτή ξαναλειτούργησαν και τα αρχαία λατομεία στην Πεντέλη.</div>\n" +
            "<br />\n" +
            " Με σεβασμό στην κληρονομιά της αρχαίας Αθήνας και εδραιώνοντας τις αρχές της αναγέννησης του αστικού κλασικισμού, ο Γκαίρτνερ σχεδίασε ένα λιτό, λειτουργικό και συμπαγές κτήριο. Είχε πρόσβαση από όλες τις πλευρές του, με τέσσερις εξωτερικές πτέρυγες που η καθεμία διέθετε τρεις ορόφους, μια μεσαία πτέρυγα με δύο πατώματα και δύο αυλές και κλιμακοστάσια που διευκόλυναν την επικοινωνία μεταξύ των ορόφων.</div>\n" +
            "<br />\n" +
            " Οι πρώτοι βασιλείς, ο Όθωνας και η Αμαλία, εγκαταστάθηκαν στην νέα τους κατοικία στις 25 Ιουλίου 1843. Στο υπόγειο στεγάζονταν οι αποθήκες. Στο ισόγειο συνυπήρχαν η Γραμματεία και το Ανακτορικό Ταμείο με τους βοηθητικούς τους χώρους, το καθολικό παρεκκλήσιο του βασιλιά, το θησαυροφυλάκιο και τα μαγειρεία. Στον πρώτο όροφο βρίσκονταν η Αίθουσα του Θρόνου, η Αίθουσα Τροπαίων, η Αίθουσα των Υπασπιστών, σε γραμμική αλληλοδιαδοχή η Αίθουσα Χορού, η Αίθουσα Παιγνίων και η Τραπεζαρία και τα βασιλικά διαμερίσματα, τα οποία επικοινωνούσαν μεταξύ τους και ήταν οι πολυτελέστεροι χώροι του κτηρίου. Το δεύτερο όροφο καταλάμβαναν τα ιδιαίτερα διαμερίσματα των διαδόχων, του αυλάρχη και του προσωπικού των Ανακτόρων.</div>\n" +
            "<br />\n" +
            " Παράλληλα με τα σχέδια κατασκευής του κτηρίου, ο Γκαίρτνερ μελέτησε αναλυτικά και προχώρησε στο σχεδιασμό και της εσωτερικής διακόσμησης διαφόρων χώρων του κτηρίου. Συνολικά σώζονται 247 σχέδιά του, τα οποία φυλάσσονται στο Αρχιτεκτονικό Μουσείο του Πολυτεχνείου του Μονάχου.</div>\n" +
            "<br />\n" +
            " Τον εξαιρετικού πλούτου και τέχνης διάκοσμο των Ανακτόρων που σχεδίασε ο Γκαίρτνερ, φανερώνουν τα ελάχιστα αρχιτεκτονικά και διακοσμητικά στοιχεία που διασώζονται έως σήμερα, όπως είναι το μεγαλοπρεπές μαρμάρινο κλιμακοστάσιο και οι Αίθουσες Τροπαίων και Υπασπιστών με την εικονογράφησή τους. Στις αίθουσες αυτές, που σήμερα αποτελούν την <em>Αίθουσα Ελευθερίου Βενιζέλου</em>, διατηρείται ζωφόρος (ύψους 1.22 μ. και μήκους 78 μ.), όπου αποτυπώνονται γεγονότα της Ελληνικής Επανάστασης και προσωπογραφίες αγωνιστών, σε σχέδια του γλύπτη Λούντβιχ Μίκαελ φον Σβαντάλερ (Ludwig Michael von Schwanthaler) και με τη συνεργασία των ζωγράφων Φίλιππου και Γεώργιου Μαργαρίτη.</div>\n" +
            "<br />\n" +
            " Ακριβώς δίπλα στο κτήριο των Ανακτόρων διαμορφώθηκε, με την προσωπική φροντίδα της Αμαλίας, ο Βασιλικός Κήπος, ο οποίος κάλυπτε την έκταση που έχει μέχρι και σήμερα. Η φύτευση του κήπου ανατέθηκε στα τέλη της δεκαετίας του 1840 στο Γάλλο κηποτέχνη Φρανσουά Λουί Μπαρώ (François Louis Bareaud), ο οποίος σχεδίασε το εσωτερικό δίκτυο των οδών και καθόρισε τη μορφή και τη θέση των διακοσμητικών στοιχείων, των κτισμάτων, των υδάτινων εκτάσεων και των περίφρακτων χώρων του.</div>\n" +
            "<br />\n" +
            "<h2>Από το 1862 έως το 1922</h2>\n" +
            "<br />\n" +
            " Μετά την έξωση του Όθωνα το 1862, τα Ανάκτορα κατοικήθηκαν από το νέο βασιλιά Γεώργιο Α’, ο οποίος έφτασε στην Αθήνα στις 17 Οκτωβρίου 1863. Ευθύς αμέσως μετά το γάμο του με την Όλγα το 1867, στο κτήριο πραγματοποιήθηκαν νέες προσθήκες και μετατροπές. Σημαντικότερη ήταν η τροποποίηση του κλιμακοστασίου της ανατολικής πτέρυγας και η δημιουργία του ορθόδοξου παρεκκλησίου του Αγίου Γεωργίου, στο δεύτερο όροφο. Επιπλέον, η διαβίωση στα Ανάκτορα μίας πολυμελούς οικογένειας και η φιλοξενία πολυπληθών επισήμων οδήγησε σε μετατροπές χώρων και σε αλλαγές χρήσης τους. Βασική, όμως, αιτία για αλλαγές και επεμβάσεις στην αρχική κατασκευή υπήρξαν οι δύο μεγάλες πυρκαγιές των Ανακτόρων: η πρώτη, το 1884, αποτέφρωσε το δεύτερο όροφο της βορινής πτέρυγας· η δεύτερη, και μεγαλύτερη, το 1909, κατέστρεψε ολοσχερώς την κεντρική πτέρυγα και τα αντίστοιχα σε αυτήν τμήματα της ανατολικής και δυτικής πτέρυγας και ανάγκασε τη βασιλική οικογένεια να μετακινηθεί στο θερινό ανάκτορο του Τατοΐου. Παρόλο που οι βασιλείς επέστρεψαν στο κτήριο το 1912, ελάχιστες από τις εγκριθείσες μελέτες επισκευών είχαν πραγματοποιηθεί, ενώ οι πολιτικές και οικονομικές εξελίξεις των επόμενων ετών, ελληνοβουλγαρικός πόλεμος, δολοφονία του βασιλιά Γεωργίου Α' και κήρυξη του Α' Παγκοσμίου Πολέμου, διέκοψαν τις εργασίες αποκατάστασης των ζημιών.</div>\n" +
            "<br />\n" +
            " Μετά τη δολοφονία του Γεωργίου του Α΄, βασιλιάς ορκίστηκε ο διάδοχος Κωνσταντίνος και βασιλικό Ανάκτορο ορίστηκε η έως τότε κατοικία του, το Μέγαρο της Ηρώδου Αττικού (σημερινό Προεδρικό Μέγαρο). Στα Παλαιά, πλέον, Ανάκτορα παρέμειναν –κατά διαστήματα- μέλη της βασιλικής οικογένειας και η βασιλομήτωρ Όλγα έως το 1922, οπότε εγκατέλειψε οριστικά την Ελλάδα.</div>\n" +
            "<br />\n" +
            "<h2>Μεταβατική Περίοδος</h2>\n" +
            "<br />\n" +
            " Το 1922 αποτέλεσε τομή στην ιστορία του κτηρίου. Τότε εγκαταλείφθηκε οριστικά από τη βασιλική οικογένεια, ενώ συγχρόνως οι ιστορικές συγκυρίες το οδήγησαν σε νέες χρήσεις. Κρατικές υπηρεσίες, ιδιωτικοί κοινωνικοί φορείς, διεθνείς οργανώσεις που συντονίστηκαν για την αντιμετώπιση των σύνθετων προβλημάτων που προέκυψαν από τη &nbsp;Μικρασιατική Καταστροφή, στεγάστηκαν στο κτήριο, μαζί με δημόσιες υπηρεσίες, που εγκαταστάθηκαν από την κυβέρνηση για την κάλυψη των αυξανόμενων μόνιμων αναγκών της. Έτσι, στη δεύτερη δεκαετία του 20ού αι. στο κτήριο βρήκαν στέγη υπηρεσίες του Υπουργείου Γεωργίας, του Υπουργείου Στρατιωτικών, του Υπουργείου Υγιεινής, η Διεθνής Υπηρεσία Μετανάστευσης, η Αστυνομία Πόλεων, η «Χριστιανική Ένωσις Νεανίδων» (Χ.Ε.Ν.), ο Ελληνικός Ερυθρός Σταυρός, ο Διεθνής Σύνδεσμος Γυναικών κ.ά. Λειτούργησαν, επίσης, ιατρείο βρεφών, οικοτροφείο φοιτητών, νοσοκομείο και ορφανοτροφείο της Near East Relief, καθώς και τα Εργαστήρια Μπενάκη. Τα διαμερίσματα του Γεωργίου Α΄ και το παρεκκλήσι στο ισόγειο χρησιμοποιήθηκαν για την αποθήκευση της βασιλικής περιουσίας, η οποία κατατέθηκε το 1935 στην Ιστορική και Εθνολογική Εταιρεία.</div>\n" +
            "<br />\n" +
            " Μέχρι το 1925, οι παρεμβάσεις στο εσωτερικό του κτηρίου ήταν πρόχειρες διαρρυθμίσεις, με στόχο τη διαίρεση μεγάλων χώρων σε μικρότερους. Η μόνη νέα κατασκευή ήταν η ανέγερση το 1925 ενός μικρού κτίσματος στον περίβολο των Παλαιών Ανακτόρων, το οποίο είναι γνωστό μέχρι σήμερα ως \"Παλατάκι\".&nbsp;</div>\n" +
            "<br />\n" +
            " Το 1927 εγκαινιάστηκε το «Μουσείο Ενθυμίων του Γεωργίου Α'», ως παράρτημα του Εθνικού-Ιστορικού Μουσείου, το οποίο λειτούργησε μέσα στο κτήριο έως το 1930 και από το 1936 έως το 1941.</div>\n" +
            "<br />\n" +
            " Με την απόφαση ανέγερσης του Μνημείου του Άγνωστου Στρατιώτη, σε σχέδια του αρχιτέκτονα Εμμανουήλ Λαζαρίδη, το 1928, άλλαξε η έως τότε πρόσοψη του κτηρίου σε σχέση με τον περιβάλλοντα χώρο.</div>\n" +
            "<br />\n" +
            "<h2>Από τα Παλαιά Ανάκτορα στο Κτήριο της Βουλής των Ελλήνων</h2>\n" +
            "<br />\n" +
            " Το Νοέμβριο του 1929 η Κυβέρνηση Ελευθερίου Βενιζέλου, ύστερα από πολλές συζητήσεις στη Βουλή, αποφάσισε τη στέγασή της, μαζί με τη Γερουσία, στο κτήριο των Παλαιών Ανακτόρων. Οι εργασίες για τη μετατροπή του κτηρίου σε Μέγαρο Βουλής και Γερουσίας σε σχέδια του αρχιτέκτονα Ανδρέα Κριεζή, αποτέλεσαν τη ριζικότερη επέμβαση σε αυτό μετά την αρχική κατασκευή του: με τις στατικές επεμβάσεις στο φέροντα οργανισμό των περιμετρικών πτερύγων, την κατεδάφιση της κεντρικής πτέρυγας και την κατασκευή νέας για τη στέγαση των Αιθουσών συνεδριάσεων της Βουλής και της Γερουσίας.</div>\n" +
            "<br />\n" +
            " Εξωτερικά, η σημαντική αλλαγή που συντελέστηκε, χωρίς, όμως, να αλλοιώνει τη μορφή και την αισθητική του, ήταν η νέα είσοδος στη βορινή πλευρά, όπου κατασκευάσθηκε ένα πρόπυλο με έξι δωρικούς κίονες με στοιχεία δανεισμένα από τα δύο άλλα πρόπυλα που κοσμούν την δυτική και την ανατολική όψη.</div>\n" +
            "<br />\n" +
            " Αλλαγές στην εσωτερική διακόσμηση και τη διαρρύθμιση έγιναν προκειμένου να ανταποκριθεί το κτήριο στη νέα του, εντελώς διαφορετική, χρήση. Στο ισόγειο διαμορφώθηκαν χώροι γραφείων του Πρωθυπουργού και του Προέδρου της Βουλής και στον πρώτο όροφο των υπηρεσιών της Βουλής. Στο δεύτερο όροφο διαρρυθμίστηκαν χώροι στέγασης της Βιβλιοθήκης της Βουλής και του Συμβουλίου της Επικρατείας. Στο ανακαινισμένο κτήριο των Παλαιών Ανακτόρων εγκαταστάθηκε η Γερουσία, καθώς και η Βιβλιοθήκη και το Συμβούλιο της Επικρατείας το 1934, το οποίο παρέμεινε στο κτήριο έως το 1992. Την 1η Ιουλίου 1935 η Ε΄ Εθνοσυνέλευση άρχισε πανηγυρικά τις εργασίες της στη νέα αίθουσα της Ολομέλειας. Από το 1935 έως σήμερα, στο Κτήριο στεγάζεται η Βουλή των Ελλήνων.</div>\n" +
            "<br />\n" +
            "<h2>Η Βουλή των Ελλήνων σήμερα </h2>\n" +
            "<br />\n" +
            " Από το 1975 γίνονται οι απαραίτητες εργασίες για τον εκσυγχρονισμό και την τεχνολογική αναβάθμιση του κτηρίου. Σκοπός είναι η καλύτερη δυνατή λειτουργία των υπηρεσιών, με την αξιοποίηση των δυνατοτήτων που προσφέρουν οι νέες τεχνολογίες, τα σύγχρονα εργαλεία και ο αναβαθμισμένος εξοπλισμός.</div>\n" +
            "<br />\n" +
            " &nbsp;Το σημαντικότερο έργο υποδομής ήταν η κατασκευή πενταώροφου υπόγειου χώρου στάθμευσης στην περίμετρο του κτηρίου, που συνέβαλε στην αποσυμφόρηση των γύρω χώρων από τα σταθμευμένα αυτοκίνητα και την ανάδειξη του κτηρίου. Με την αποπεράτωση του υπόγειου σταθμού πραγματοποιήθηκε σειρά εργασιών διαμόρφωσης του περιβάλλοντα χώρου, όπως η διευθέτηση της κυκλοφορίας εισόδων και εξόδων του σταθμού, η μαρμαρόστρωση και η φύτευση του περιβόλου. &nbsp;</div>\n" +
            "<br />\n" +
            " Από τις σημαντικότερες αισθητικές παρεμβάσεις στο εξωτερικό του κτηρίου υπήρξε η τοποθέτηση του ανδριάντα του Χαριλάου Τρικούπη και του Ελευθερίου Βενιζέλου, έργα του γλύπτη Γιάννη Παππά, στο δυτικό περίβολο του κτηρίου, ορατά από μεγάλη απόσταση. Το 2003 τοποθετήθηκε το άγαλμα της <em>Μάνας</em> του Χρήστου Καπράλου στον ανατολικό περίβολο.</div>\n" +
            "<br />\n" +
            " Το 2002 τοποθετήθηκε στο Περιστύλιο της Αίθουσας Συνεδριάσεων της Ολομέλειας το <em>Μνημείο της μάχης της Πίνδου</em> του Χρήστου Καπράλου. Η ανάγλυφη ζωφόρος, μήκους 40 μέτρων και ύψους 1,10 μέτρων, εξιστορεί σε επτά επεισόδια τα περάσματα από την Ειρήνη, τον Πόλεμο, την Κατοχή, την Αντίσταση και πάλι την Ειρήνη και τη Συμφιλίωση. Έτσι δημιουργήθηκε ένας ενδιαφέρων διάλογος –σε επίπεδο εικαστικό και συμβολικό– με τη ζωγραφική ζωφόρο της <em>Αίθουσας Ελευθερίου Βενιζέλου</em>. Πρόσφατα, μάλιστα, ολοκληρώθηκε η συντήρηση και η αποκατάσταση της ζωγραφικής διακόσμησης αυτής της αίθουσας, καθώς και της Αίθουσας Συνεδριάσεων της Ολομέλειας της Βουλής, της Αίθουσας της Γερουσίας και του Εντευκτηρίου.</div>\n" +
            "<br />\n" +
            " Τον Απρίλιο του 2009 εγκαινιάστηκε έκθεση που παρουσιάζει παραστατικά ακριβώς αυτήν την ιστορική διαδρομή του κτηρίου. Η έκθεση συνοδεύεται από συλλογικό επιστημονικό τόμο με τον τίτλο: Το Κτήριο της Βουλής των Ελλήνων\n" +
            "<br />\n" +
            " Μέσα από αρχειακά τεκμήρια και επιστημονική έρευνα, αναδύεται η εικόνα ενός κτηρίου με σταθερή εξωτερικά όψη, το οποίο απέδειξε απεριόριστες δυνατότητες ευελιξίας στις ανάγκες μίας πολύπλοκης οργάνωσης.</div>\n" +
            "<br />\n" +
            "<br />\n";

    public KtirioFragment() {
        // Required empty public constructor
    }

    @Override
    public void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
    }

    @Override
    public View onCreateView(LayoutInflater inflater, ViewGroup container,
                             Bundle savedInstanceState) {
        View view = inflater.inflate(R.layout.fragment_keimena, container, false);

        TextView tv = (TextView) view.findViewById(R.id.textThesmos);
        tv.setText(Html.fromHtml(htmlText));
        // Inflate the layout for this fragment
        return view;
    }

}