package gr.sextreme.main;

import android.os.Bundle;
import android.support.v4.app.Fragment;
import android.text.Html;
import android.view.LayoutInflater;
import android.view.View;
import android.view.ViewGroup;
import android.widget.TextView;

import gr.sextreme.R;

public class ThesmosFragment extends Fragment {
    private final String htmlText = "<h2>Tι είναι η Bουλή</h2>\n" +
            "Η Βουλή είναι ο κορυφαίος δημοκρατικός θεσμός, μέσω του οποίου αντιπροσωπεύεται ο λαός δια των βουλευτών.\n" +
            "<h2>H Ολομέλεια και το Tμήμα</h2>\n" +
            "Η Ολομέλεια της Βουλής αποτελείται από το σύνολο των Βουλευτών, οι οποίοι εκλέγονται στις βουλευτικές εκλογές. Οι εκλογές διεξάγονται κάθε τέσσερα χρόνια, εκτός αν η Βουλή διαλυθεί νωρίτερα. Το χρονικό διάστημα μεταξύ δύο εκλογικών αναμετρήσεων αποτελεί μία «Βουλευτική Περίοδο». Οι Βουλευτικές Περίοδοι αριθμούνται σε συνεχή σειρά από το 1974 και με ελληνική αρίθμηση.\n" +
            "Κατά τη διάρκεια της Βουλευτικής Περιόδου, η Βουλή συνέρχεται σε τακτικές Συνόδους (από το Σύνταγμα προβλέπεται και η σύγκληση της Βουλής σε έκτακτες και ειδικές Συνόδους).\n" +
            "Η Ολομέλεια της Βουλής συνέρχεται σε τακτική Σύνοδο την πρώτη Δευτέρα του Οκτωβρίου κάθε έτους. Η διάρκεια της τακτικής Συνόδου δε μπορεί να είναι μικρότερη των πέντε μηνών. Σε τακτική Σύνοδο συγκαλείται η Ολομέλεια της Βουλής μέσα σε τριάντα ημέρες από τη διεξαγωγή των βουλευτικών εκλογών.\n" +
            "Η Ολομέλεια της Βουλής ασκεί κατεξοχήν τις αρμοδιότητες του νομοθετικού έργου και του κοινοβουλευτικού ελέγχου.\n" +
            "Κατά τη διάρκεια της διακοπής των εργασιών της Βουλής, δηλαδή κατά το χρονικό διάστημα μεταξύ δύο Συνόδων, μέρος του Νομοθετικού Έργου αλλά και του Κοινοβουλευτικού Ελέγχου ασκείται από τις συνθέσεις του Τμήματος Διακοπής των Εργασιών της Βουλής.\n" +
            "Υπάρχουν τρεις διαδοχικές συνθέσεις του Τμήματος Διακοπής κάθε χρόνο κατά τη διάρκεια των θερινών διακοπών και κάθε μία αποτελείται από το 1/3 του όλου αριθμού των Βουλευτών.\n" +
            "Στο Τμήμα Διακοπής των Εργασιών της Βουλής μετέχει το ένα τρίτο του όλου αριθμού των Βουλευτών. Η σύνθεσή του αλλάζει περιοδικά, με τρόπο που να εξασφαλίζει την ισόχρονη, κατά το δυνατό, συμμετοχή σε αυτό όλων των Βουλευτών.\n" +
            "<h2>Η Βουλή αποφασίζει</h2>\n" +
            "Η Ολομέλεια της Βουλής αποφασίζει με την απόλυτη πλειοψηφία των παρόντων μελών της, η οποία δεν μπορεί να είναι μικρότερη από το 1/4 του όλου αριθμού των Βουλευτών (75 βουλευτές). Οι περιπτώσεις που απαιτούν ειδική πλειοψηφία αναφέρονται στο Σύνταγμα και τον Κανονισμό της Βουλής.\n" +
            "<h2><strong>Η Βουλή νομοθετεί</strong></h2>\n" +
            "Η νομοθετική λειτουργία, δηλαδή η ψήφιση των νομοσχεδίων και των προτάσεων νόμου και ο κοινοβουλευτικός έλεγχος προς την Κυβέρνηση, αποτελούν τον πυρήνα του κοινοβουλευτικού έργου.\n" +
            "Τη νομοθετική πρωτοβουλία έχει είτε η Κυβέρνηση, δηλαδή ένας ή περισσότεροι Υπουργοί της, είτε οι Βουλευτές, ατομικά ή συλλογικά. Οι Υπουργοί καταθέτουν στη Βουλή τα νομοσχέδια (ή σχέδια νόμου), τροπολογίες και προσθήκες. Αντίστοιχα, οι Βουλευτές καταθέτουν στη Βουλή προτάσεις νόμων, τροπολογίες και προσθήκες, υπό τις προϋποθέσεις που ορίζει το Σύνταγμα για την υποβολή τους.\n" +
            "<h3><strong>Η κατάθεση των νομοσχεδίων και των προτάσεων νόμων στη Βουλή</strong></h3>\n" +
            "Τα νομοσχέδια και οι προτάσεις νόμων συνοδεύονται από αιτιολογική έκθεση, η οποία επεξηγεί αναλυτικά τους στόχους των νομοσχεδίων και των προτάσεων νόμων. Τα νομοσχέδια ή οι προτάσεις νόμου που συνεπάγονται επιβάρυνση του κρατικού προϋπολογισμού, συνοδεύονται από έκθεση του Γενικού Λογιστηρίου του Κράτους, η οποία προσδιορίζει τις δαπάνες που προκύπτουν από την εφαρμογή των προτεινόμενων διατάξεων. Σε περίπτωση νομοσχεδίου που συνεπάγεται δαπάνη ή ελάττωση εσόδων, ως υποχρεωτικό συνοδευτικό έγγραφο υποβάλλεται επιπρόσθετα η ειδική έκθεση του Υπουργού Οικονομικών και του αρμόδιου Υπουργού, η οποία αναφέρει τον τρόπο κάλυψης της δαπάνης. Επίσης, συνοδεύονται υποχρεωτικά από έκθεση αξιολόγησης των συνεπειών της ρύθμισης και από έκθεση επί της δημόσιας διαβούλευσης που έχει προηγηθεί της κατάθεσής τους. Επιπλέον, υποβάλλεται και η έκθεση της Επιστημονικής Υπηρεσίας της Βουλής, που επεξεργάζεται νομοτεχνικά τις προτεινόμενες διατάξεις.\n" +
            "Τα νομοσχέδια και οι προτάσεις νόμων κατατίθενται στη Διεύθυνση Νομοθετικού Έργου της Βουλής μέχρι την ημέρα Πέμπτη και ώρα 20.00, ενώ η κατάθεση προσθηκών ή τροπολογιών την Παρασκευή γίνεται το αργότερο μέχρι ώρα 13.00. Στη συνέχεια, τα νομοσχέδια και οι προτάσεις νόμου ανακοινώνονται στο Σώμα, δηλαδή ενώπιον των Βουλευτών, και παραπέμπονται είτε για επεξεργασία και εξέταση είτε για συζήτηση και ψήφιση στην αρμόδια Διαρκή Επιτροπή της Βουλής.\n" +
            "Η επεξεργασία και εξέταση του νομοσχεδίου ή της πρότασης νόμου γίνεται σε δύο στάδια, μεταξύ των οποίων μεσολαβεί διάστημα τουλάχιστον επτά (7) πλήρων ημερών. Κατά το πρώτο στάδιο διεξάγεται συζήτηση επί της αρχής και επί των άρθρων και κατά το δεύτερο στάδιο γίνεται δεύτερη ανάγνωση, συζήτηση και ψήφιση επί ενός εκάστου άρθρου.\n" +
            "Κατά την επεξεργασία νομοσχεδίου ή πρότασης νόμου από την αρμόδια κοινοβουλευτική επιτροπή και μέχρι τη δεύτερη ανάγνωση των άρθρων κάθε ειδική μόνιμη επιτροπή μπορεί, να διατυπώνει γνώμη για θέμα ιδιαίτερης σημασίας του οικείου νομοσχεδίου ή προτάσεως, το οποίο εμπίπτει στην αρμοδιότητά της.\n" +
            "<h3><strong>Η Βουλή συζητά και ψηφίζει τα νομοσχέδια και τις προτάσεις νόμων</strong></h3>\n" +
            "Μετά την επεξεργασία τους ή τη συζήτηση και ψήφισή τους από την αρμόδια Διαρκή Επιτροπή, τα νομοσχέδια και οι προτάσεις νόμων εγγράφονται στην Ημερήσια Διάταξη Νομοθετικού Έργου της Βουλής προς συζήτηση και ψήφιση από την Ολομέλεια της Βουλής. Στο Τμήμα Διακοπής των Εργασιών της Βουλής συζητούνται όλα τα νομοσχέδια, εκτός από αυτά που ανήκουν στην αρμοδιότητα της Ολομέλειας.\n" +
            "Τα νομοσχέδια και οι προτάσεις νόμου ψηφίζονται κατ\\' αρχήν, κατ\\' άρθρον και στο σύνολο.\n" +
            "Ο Πρόεδρος της Δημοκρατίας εκδίδει και δημοσιεύει τους νόμους που έχουν ψηφισθεί από τη Βουλή, αφού προηγουμένως υπογραφούν από τους αρμόδιους Υπουργούς.\n" +
            "<br />\n" +
            "<p> Η Βουλή ασκεί και άλλες αρμοδιότητες, όπως:\n" +
            "<br />\n" +
            "Η Αναθεώρηση του Συντάγματος\n" +
            "<br />\n" +
            "Η εκλογή του Προέδρου της Δημοκρατίας\n" +
            "<br />\n" +
            "Η ψήφιση του Κανονισμού της Βουλής\n" +
            "<br />\n" +
            "Η ψήφιση του προϋπολογισμού, του απολογισμού και του γενικού ισολογισμού του Κράτους καθώς και η ψήφιση του προϋπολογισμού και του απολογισμού της Βουλής\n" +
            "<br />\n" +
            "Η έγκριση των προγραμμάτων οικονομικής και κοινωνικής ανάπτυξης\n" +
            "<br />\n" +
            "Η απόφαση για τη διεξαγωγή δημοψηφίσματος\n" +
            "<br />\n" +
            "Η άρση ασυλίας των Βουλευτών\n" +
            "<br />\n" +
            "Η πρόσκληση Αρχηγών Κρατών, Προέδρων Κυβερνήσεων και προσωπικοτήτων διεθνούς κύρους να απευθυνθούν στη Βουλή.\n" +
            "<br />\n" +
            "<h2><strong>Η Βουλή ελέγχει</strong></h2>\n" +
            "Η Κυβέρνηση υπόκειται στον έλεγχο της Βουλής, όπως προβλέπεται στο Σύνταγμα και τον Κανονισμό της Βουλής.\n" +
            "<h3><strong>Η ψήφος εμπιστοσύνης</strong></h3>\n" +
            "Η Κυβέρνηση οφείλει να έχει την εμπιστοσύνη της Βουλής. Έτσι κάθε φορά που σχηματίζεται νέα Κυβέρνηση (μετά από βουλευτικές εκλογές ή μετά από παραίτηση της προηγούμενης), οφείλει να εμφανίζεται ενώπιον της Βουλής και να ζητά ψήφο εμπιστοσύνης. Η Κυβέρνηση έχει τη δυνατότητα και όποτε άλλοτε θελήσει κατά τη διάρκεια της βουλευτικής περιόδου να ζητήσει από τη Βουλή ψήφο εμπιστοσύνης. Αντίστοιχα, από την ίδια τη Βουλή μπορεί να υποβληθεί πρόταση δυσπιστίας, δηλαδή να αμφισβητηθεί η εμπιστοσύνη της Βουλής προς την Κυβέρνηση. Η πρόταση δυσπιστίας πρέπει να είναι υπογεγραμμένη από 50 τουλάχιστον Βουλευτές (το ένα έκτο του όλου αριθμού) και να αναφέρει σαφώς τα θέματα για τα οποία θα διεξαχθεί η συζήτηση. Για να γίνει δεκτή η πρόταση δυσπιστίας, δηλαδή για να αποδειχθεί ότι η Κυβέρνηση δεν διαθέτει πλέον την εμπιστοσύνη της Βουλής, πρέπει να υπερψηφιστεί από την απόλυτη πλειοψηφία του όλου αριθμού των Βουλευτών, δηλαδή από 151 Βουλευτές. Πρόταση δυσπιστίας μπορεί να υποβληθεί μόνο μετά από πάροδο εξαμήνου αφότου η Βουλή απέρριψε πρόταση δυσπιστίας.\n" +
            "Κατ\\' εξαίρεση μπορεί να υποβληθεί πρόταση δυσπιστίας και πριν από την πάροδο εξαμήνου, αν είναι υπογεγραμμένη από την πλειοψηφία του όλου αριθμού των βουλευτών.\n" +
            "<h3><strong>Άλλα μέσα Κοινοβουλευτικού ελέγχου</strong></h3>\n" +
            "Η πρόταση δυσπιστίας δεν είναι το μόνο μέσο ελέγχου της Κυβέρνησης από τη Βουλή. Το Σύνταγμα και, κυρίως, ο Κανονισμός της Βουλής προβλέπουν και άλλα μέσα άσκησης του Κοινοβουλευτικού ελέγχου. Με αυτά, είτε ζητούνται πληροφορίες και διευκρινίσεις από την Κυβέρνηση, είτε ασκείται έλεγχος για την πολιτική της σε έναν ορισμένο τομέα για πράξεις ή παραλείψεις της.\n" +
            "<h4><strong>Οι αναφορές</strong></h4>\n" +
            "Οι πολίτες, μεμονωμένα ή συλλογικά, μπορούν να απευθύνουν εγγράφως και επωνύμως παράπονα ή αιτήματα στη Βουλή. Oι Boυλευτές πoυ επιθυμoύν να υιoθετήσoυν αναφoρά την πρoσυπoγράφoυν κατά την κατάθεσή της ή τo δηλώνoυν κατά την ανακoίνωσή της στη Boυλή. Ο Υπουργός είναι υποχρεωμένος να απαντήσει εγγράφως εντός 25 ημερών στην αναφορά την οποία έχει υιοθετήσει Βουλευτής.\n" +
            "<h4><strong>Οι ερωτήσεις</strong></h4>\n" +
            "Οι Βουλευτές μπορούν να απευθύνουν εγγράφως στους Υπουργούς ερωτήσεις για οποιαδήποτε δημόσια υπόθεση. Οι ερωτήσεις αυτές αποσκοπούν στην ενημέρωση της Βουλής σχετικά με την υπόθεση αυτή. Οι Υπουργοί οφείλουν να απαντούν εγγράφως εντός 25 ημερών.\n" +
            "<h4><strong>Οι επίκαιρες ερωτήσεις</strong></h4>\n" +
            "Κάθε Βουλευτής έχει δικαίωμα, για θέματα που άπτονται της άμεσης επικαιρότητας, να υποβάλει γραπτές επίκαιρες ερωτήσεις προς τον Πρωθυπουργό ή τους Υπουργούς, οι οποίοι απαντούν προφορικά. Επίκαιρες ερωτήσεις συζητούνται στην Ολομέλεια αλλά και στο Τμήμα Διακοπής των Εργασιών της Βουλής στην πρώτη και τρίτη σύνθεσή του.\n" +
            "<h4><strong>Οι επερωτήσεις</strong></h4>\n" +
            "Οι επερωτήσεις αποσκοπούν στον έλεγχο της Κυβέρνησης για πράξεις ή παραλείψεις της. Οι επερωτήσεις συζητούνται στην Ολομέλεια της Βουλής. Εάν υπάρχουν περισσότερες επερωτήσεις για το ίδιο θέμα, η Βουλή μπορεί να αποφασίσει την ταυτόχρονη συζήτησή τους ή ακόμη και γενίκευση της συζήτησης.\n" +
            "<h4><strong>Οι επίκαιρες επερωτήσεις</strong></h4>\n" +
            "Για θέματα της άμεσης επικαιρότητας οι Βουλευτές έχουν το δικαίωμα να υποβάλουν επίκαιρες επερωτήσεις. Οι επίκαιρες επερωτήσεις συζητούνται στην Ολομέλεια αλλά και στο Τμήμα Διακοπής των Εργασιών της Βουλής στην πρώτη και τρίτη σύνθεσή του. Η διαδικασία συζήτησης που προβλέπει ο Κανονισμός για τις επερωτήσεις εφαρμόζεται και στις επίκαιρες επερωτήσεις.\n" +
            "<h4><strong>Επίκαιρες ερωτήσεις προς τον Πρωθυπουργό ( Ώρα του Πρωθυπουργού)</strong></h4>\n" +
            "Ο Πρωθυπουργός μία φορά την εβδομάδα απαντά σε δύο τουλάχιστον επίκαιρες ερωτήσεις, που απευθύνονται στον ίδιο. Στη συζήτηση που διεξάγεται στην Ολομέλεια της Βουλής λαμβάνουν το λόγο ο Πρωθυπουργός και ο Βουλευτής που έχει υποβάλει την επίκαιρη ερώτηση, ο οποίος την αναπτύσσει προφορικά σε 2 λεπτάΟι περισσότερες επίκαιρες ερωτήσεις υποβάλλονται από τους Προέδρους των Κοινοβουλευτικών ομάδων, αλλά και οι Βουλευτές έχουν τη δυνατότητα να απευθύνουν επίκαιρες ερωτήσεις προς τον Πρωθυπουργό. Εάν το θέμα της επίκαιρης ερώτησης που απευθύνεται στον Πρωθυπουργό είναι της αποκλειστικής αρμοδιότητας Υπουργού, τότε μπορεί να απαντήσει ο αρμόδιος Υπουργός.\n" +
            "<h4><strong>Οι αιτήσεις κατάθεσης εγγράφων</strong></h4>\n" +
            "Οι Βουλευτές έχουν το δικαίωμα να ζητούν εγγράφως από τους Υπουργούς την κατάθεση εγγράφων σχετικών με κάποια δημόσια υπόθεση. Ο Υπουργός οφείλει να αποστείλει στη Βουλή εντός 30 ημερών τα ζητούμενα έγγραφα. Ωστόσο δεν κατατίθενται έγγραφα που αφορούν διπλωματικό, στρατιωτικό ή σχετικό με την ασφάλεια του Κράτους ζήτημα.\n" +
            "<h4><strong>Οι συζητήσεις με πρωτοβουλία Βουλευτών</strong></h4>\n" +
            "Τόσο στις Διαρκείς Επιτροπές όσο και στην Ολομέλεια μπορεί, υπό ορισμένες προϋποθέσεις, να διεξάγονται με πρωτοβουλία Βουλευτών συζητήσεις για θέματα γενικότερης σημασίας ή ενδιαφέροντος.\n" +
            "<h4><strong>Ο έλεγχος επί των Ανεξάρτητων Αρχών</strong></h4>\n" +
            "Κάθε Ανεξάρτητη Αρχή υποβάλλει στον Πρόεδρο της Βουλής μέχρι την 31η Μαρτίου κάθε έτους έκθεση για τα πεπραγμένα της κατά το προηγούμενο έτος. Η έκθεση διαβιβάζεται είτε στην Επιτροπή Θεσμών και Διαφάνειας, είτε στην αρμόδια Διαρκή Επιτροπή ή σε άλλη συνιστώμενη επιτροπή, οι οποίες υποβάλλουν τα πορίσματα των συζητήσεών τους στον Πρόεδρο της Βουλής. Ο Πρόεδρος τα υποβάλλει στην Κυβέρνηση και στην ελεγχόμενη αρχή. Επί των πορισμάτων μπορεί να διεξαχθεί συζήτηση στην Ολομέλεια της Βουλής χωρίς τη διεξαγωγή ψηφοφορίας.\n" +
            "<h4><strong>Πληροφόρηση και ενημέρωση της Βουλής</strong></h4>\n" +
            "Για την έγκαιρη και υπεύθυνη πληροφόρηση της Βουλής ο Πρωθυπουργός μπορεί να ζητήσει να κάνει ανακοινώσεις ή δηλώσεις στη Βουλή για οποιαδήποτε σοβαρή δημόσια υπόθεση. Στην περίπτωση αυτή διεξάγεται σύντομη συζήτηση, στην οποία συμμετέχουν οι Πρόεδροι των Κοινοβουλευτικών Ομάδων.\n" +
            "Επίσης, οι Υπουργοί ενημερώνουν τη Βουλή για σοβαρά θέματα της αρμοδιότητάς τους.\n" +
            "<h4><strong>Προ Ημερησίας Διατάξεως Συζητήσεις</strong></h4>\n" +
            "Αφορούν εθνικά θέματα ή θέματα γενικότερου ενδιαφέροντος και διεξάγονται σε επίπεδο Αρχηγών Κομμάτων. Σε αυτές τις συζητήσεις ομιλούν ο Πρωθυπουργός, οι Πρόεδροι των Κοινοβουλευτικών Ομάδων καθώς και ένας ή δύο Υπουργοί.\n" +
            "Σε κάθε σύνοδο, διεξάγονται υποχρεωτικά επτά συζητήσεις εκ των οποίων μία αποτελεί δικαίωμα της Κυβέρνησης, μία του Προέδρου της Βουλής και οι άλλες πέντε της Αντιπολίτευσης.\n" +
            "<h2><strong>Σημαντικές καινοτομίες</strong></h2>\n" +
            "<p>Με την τροποποίηση του Κανονισμού της Βουλής τον Ιούλιο του 2010 προβλέφθηκαν, μεταξύ άλλων, τα εξής:\n" +
            "<br />\n" +
            "<h3><em>Στο Πρώτο Μέρος του Κανονισμού της Βουλής:</em></h3>\n" +
            "Η ενίσχυση της Επιτροπής Θεσμών και Διαφάνειας, η οποία μπορεί να καλεί σε ακρόαση λειτουργούς του κράτους, καθώς και οποιοδήποτε δημόσιο πρόσωπο για θέματα που αφορούν στη λειτουργία των θεσμών και της διαφάνειας, η προσέλευση των οποίων είναι υποχρεωτική. Η επιτροπή μπορεί να καλεί σε ακρόαση τον πρόεδρο και τους αντιπροέδρους του Συμβουλίου της Επικρατείας, του Αρείου Πάγου και του Ελεγκτικού Συνεδρίου, τον εισαγγελέα του Αρείου Πάγου, τον γενικό επίτροπο της Επικρατείας του Ελεγκτικού Συνεδρίου και τον γενικό επίτροπο των διοικητικών δικαστηρίων για θέματα που αφορούν σε λειτουργικά ζητήματα της δικαιοσύνης προς το σκοπό της ενίσχυσης της διαφάνειας.\n" +
            "Η επιτροπή έχει την εξουσία συλλογής πληροφοριών και εγγράφων και την εξουσία κλήσης και εξέτασης προσώπων.\n" +
            "Η επιτροπή στο τέλος κάθε συνόδου υποβάλλει έκθεση στην Ολομέλεια της Βουλής, η οποία καταχωρίζεται στα πρακτικά και για την οποία γίνεται συζήτηση στην Ολομέλεια σε ειδική συνεδρίαση, χωρίς διεξαγωγή ψηφοφορίας.\n" +
            "<h3><em>Στο Δεύτερο Μέρος του Κανονισμού της Βουλής:</em></h3>\n" +
            "Ιδρύεται στη Βουλή Γραφείο Προϋπολογισμού του Κράτους, που υπάγεται στον Πρόεδρο της Βουλής και είναι αρμόδιο για :\n" +
            "<br />\n" +
            "α) την παρακολούθηση της εκτέλεσης του Προϋπολογισμού του Κράτους,\n" +
            "<br />\n" +
            "β) τη συγκέντρωση πληροφοριών σχετικών με τον Προϋπολογισμό του Κράτους, την ανάλυση και αξιολόγηση των στοιχείων του Προϋπολογισμού των προβλέψεων για τα δημόσια έσοδα και δαπάνες και τη διατηρησιμότητα των μακροχρόνιων δημοσιονομικών μεγεθών,\n" +
            "<br />\n" +
            "γ) την υποβοήθηση του έργου της Ειδικής Επιτροπής του απολογισμού και του γενικού ισολογισμού του Κράτους και ελέγχου της εκτέλεσης του προϋπολογισμού του Κράτους, καθώς και της Διαρκούς Επιτροπής Οικονομικών Υποθέσεων,\n" +
            "<br />\n" +
            "δ) τη σύνταξη και υποβολή προς τις ανωτέρω επιτροπές εκθέσεων σχετικά με την τήρηση των δημοσιονομικων στόχων που τίθενται στα Μεσοπρόθεσμα Δημοσιονομικά Πλαίσια Στρατηγικής, τις παραδοχές των μακροοικονομικών εκτιμήσεων και δημοσιονομικών προβλέψεων που αυτά θέτουν και τη συνολική εναρμόνιση της δημοσιονομικής πολιτικής της Γενικής Κυβέρνησης με τις αρχές και τις διαδικασίες του νόμου για τη \"Δημοσιονοκή Διαχείριση και Ευθύνη\".\n" +
            "<br />\n" +
            "Απαγορεύεται η μετατροπή της εργασιακής σχέσης του μετακλητού υπαλλήλου που επάγεται σε διορισμό σε οργανική ή προσωποπαγή θέση μονίμου ή ιδιωτικού δικαίου προσωπικού της Βουλής.\n\n" +
            "<br />\n" +
            "<br />\n";

    public ThesmosFragment() {
        // Required empty public constructor
    }

    @Override
    public void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);

    }

    @Override
    public View onCreateView(LayoutInflater inflater, ViewGroup container,
                             Bundle savedInstanceState) {
        View view = inflater.inflate(R.layout.fragment_keimena, container, false);

        TextView tv = (TextView) view.findViewById(R.id.textThesmos);
        tv.setText(Html.fromHtml(htmlText));
        // Inflate the layout for this fragment
        return view;
    }
}