package gr.sextreme.vouli;

import android.os.Bundle;
import android.support.v4.app.Fragment;
import android.text.Html;
import android.view.LayoutInflater;
import android.view.View;
import android.view.ViewGroup;
import android.widget.TextView;

import gr.sextreme.R;

public class EpitropesFragment extends Fragment {

    private final String htmlText = "(άρθρα 68 του Σ και 31-48 και  89-91 του ΚτΒ)\n" +
            "<br />\n" +
            "<p>Η Βουλή των Ελλήνων ασκεί νομοθετικό έργο και κοινοβουλευτικό έλεγχο. Για το σκοπό αυτό συνιστώνται επιτροπές που συγκροτούνται από Bουλευτές, ανάλογα με τη δύναμη των κοινοβουλευτικών ομάδων και των ανεξάρτητων Bουλευτών. Οι επιτροπές επιλαμβάνονται του νομοθετικού έργου ή του κοινοβουλευτικού ελέγχου ή ειδικών θεμάτων. Το Σύνταγμα και ο Κανονισμός της Βουλής προβλέπουν τις ακόλουθες επιτροπές:\n" +
            "<br />\n" +
            "<h2>Διαρκείς επιτροπές </h2>\n" +
            "<br />\n" +
            "<p>Συνιστώνται και συγκροτούνται στην αρχή κάθε τακτικής συνόδου της Βουλής με απόφαση του Προέδρου της Βουλής, προκειμένου να επεξεργάζονται και να εξετάζουν σχέδια νόμων ή προτάσεις νόμων. Μετά την αναθεώρηση του Συντάγματος το 2001 και την αντίστοιχη τροποποίηση του Κανονισμού της Βουλής, μπορούν να ασκούν και νομοθετικό έργο και κοινοβουλευτικό έλεγχο. Επίσης μπορούν να συζητούν θέματα συναφή με την αρμοδιότητά τους, καθώς και να διατυπώνουν γνώμη για τους προτεινόμενους προς διορισμό σε ορισμένες θέσεις, εφόσον αυτό προβλέπεται από τον Κανονισμό ή νόμο. Επιπλέον τις διαρκείς επιτροπές ενημερώνουν ο αρμόδιος Υπουργός, ή ο εκπρόσωπος φορέα μαζί με τον εποπτεύοντα Υπουργό, πριν από τη σύναψη δημοσίων συμβάσεων μεγάλης αξίας.</p>\n" +
            "<br />\n" +
            "<p>Προβλέπονται έξι (6) διαρκείς επιτροπές :</p>\n" +
            " Επιτροπή μορφωτικών υποθέσεων  \n" +
            "<br />\n" +
            " Επιτροπή εθνικής άμυνας και εξωτερικών υποθέσεων  \n" +
            "<br />\n" +
            " Επιτροπή οικονομικών υποθέσεων  \n" +
            "<br />\n" +
            " Επιτροπή κοινωνικών υποθέσεων  \n" +
            "<br />\n" +
            " Επιτροπή δημόσιας διοίκησης, δημόσιας τάξης και δικαιοσύνης  \n" +
            "<br />\n" +
            " Επιτροπή παραγωγής και εμπορίου  \n" +
            "<br />\n" +
            "\n" +
            "<p>Στη διαρκή επιτροπή κοινωνικών υποθέσεων συνιστάται υποεπιτροπή για τη μελέτη και αντιμετώπιση του προβλήματος των ναρκωτικών. \n" +
            "Σε κάθε διαρκή επιτροπή μπορεί να συσταθούν υποεπιτροπές, κατά υπουργεία.</p>\n" +
            "<br />\n" +
            "<h2>Ειδικές διαρκείς επιτροπές </h2>\n" +
            "Προβλέπονται τέσσερις ειδικές διαρκείς επιτροπές, στις οποίες εφαρμόζονται οι διατάξεις περί διαρκών επιτροπών. Αυτές είναι:</p>\n" +
            " Επιτροπή του απολογισμού και του γενικού ισολογισμού του Κράτους και ελέγχου της εκτέλεσης του προϋπολογισμού του Κράτους  \n" +
            " Επιτροπή ευρωπαϊκών υποθέσεων  \n" +
            " Επιτροπή εξοπλιστικών προγραμμάτωνκαι συμβάσεων  \n" +
            " Επιτροπή παρακολούθησης του Συστήματος Κοινωνικής Ασφάλισης  \n" +
            "<br />\n" +
            "<h2>Ειδικές επιτροπές</h2>\n" +
            "Συνιστώνται από τον Πρόεδρο της Βουλής, μετά από πρόταση της Κυβέρνησης, με σκοπό να επεξεργασθούν και να εξετάσουν συγκεκριμένα σχέδια νόμων ή προτάσεις νόμων. Η λειτουργία τους διαρκεί εως ότου πάρουν οριστική απόφαση σχετικά με την επεξεργασία και εξέταση των νομοσχεδίων και των προτάσεων νόμων για τα οποία συστάθηκαν.</p>\n" +
            "<br />\n" +
            "<h2>Ειδικές μόνιμες επιτροπές</h2>\n" +
            "Συνιστώνται στην αρχή κάθε τακτικής συνόδου της Βουλής, με απόφαση του Προέδρου της Βουλής, πλην της Ειδικής Μόνιμης Επιτροπής Θεσμών και Διαφάνειας, η οποία συνιστάται στην αρχή κάθε βουλευτικής περιόδου και λειτουργεί καθ'όλη τη διάρκειά της.</p>\n" +
            "<br />\n" +
            "<p>Οι ειδικές μόνιμες επιτροπές είναι δέκα (10) :</p>\n" +
            " Ειδική μόνιμη επιτροπή θεσμών και διαφάνειας  \n" +
            "<br />\n" +
            " Ειδική μόνιμη επιτροπή Ελληνισμού της Διασποράς  \n" +
            "<br />\n" +
            " Ειδική μόνιμη επιτροπή προστασίας περιβάλλοντος  \n" +
            "<br />\n" +
            " Ειδική μόνιμη επιτροπή έρευνας και τεχνολογίας  \n" +
            "<br />\n" +
            " Ειδική μόνιμη επιτροπή ισότητας, νεολαίας και δικαιωμάτων του ανθρώπου  \n" +
            "<br />\n" +
            " Ειδική μόνιμη επιτροπή περιφερειών  \n" +
            "<br />\n" +
            " Ειδική μόνιμη επιτροπή οδικής ασφάλειας  \n" +
            "<br />\n" +
            " Ειδική μόνιμη επιτροπή κοινοβουλευτικής δεοντολογίας  \n" +
            "<br />\n" +
            " Ειδική μόνιμη επιτροπή σωφρονιστικού συστήματος  \n" +
            "<br />\n" +
            " Ειδική Μόνιμη Επιτροπή παρακολούθησης των αποφάσεων του Ευρωπαϊκού Δικαστηρίου των Δικαιωμάτων του Ανθρώπου  \n" +
            "<br />\n" +
            "<p>Επίσης, συνιστώνται υποεπιτροπές ειδικών μονίμων επιτροπών, ως ακολούθως:</p>\n" +
            " Στην ειδική μόνιμη επιτροπή προστασίας περιβάλλοντος συνιστάται υποεπιτροπή υδατικών πόρων.  \n" +
            "<br />\n" +
            " Στην ειδική μόνιμη επιτροπή ισότητας, νεολαίας και δικαιωμάτων του ανθρώπου συνιστάται υποεπιτροπή για τα θέματα των ατόμων με αναπηρία.  \n" +
            "<br />\n" +
            " Στην ειδική μόνιμη επιτροπή περιφερειών συνιστάται υποεπιτροπή νησιωτικών και ορεινών περιοχών.<strong>&nbsp;</strong>  \n" +
            "<br />\n" +
            "<h2>Επιτροπές εσωτερικών θεμάτων της Βουλής</h2>\n" +
            "Οι επιτροπές αυτές είναι:</p>\n" +
            "<br />\n" +
            " Eπιτροπή Κανονισμού της Βουλής  \n" +
            "<br />\n" +
            " Επιτροπή Οικονομικών της Βουλής  \n" +
            "<br />\n" +
            " Επιτροπή Βιβλιοθήκης της Βουλής  \n" +
            "<br />\n" +
            "<p>Συνιστώνται η μεν Επιτροπή Κανονισμού της Βουλής στην αρχή κάθε βουλευτικής περιόδου, οι δε Επιτροπές Οικονομικών της Βουλής και Βιβλιοθήκης της Βουλής στην αρχή κάθε τακτικής συνόδου της Βουλής και ασχολούνται με θέματα εσωτερικής &nbsp;λειτουργίας της Βουλής.</p>\n" +
            "<br />\n" +
            "<h2>Επιτροπή δημοσίων επιχειρήσεων, τραπεζών, οργανισμών κοινής ωφελείας και φορέων κοινωνικής ασφάλισης</h2>\n" +
            "Συνιστάται με απόφαση του Προέδρου της Βουλής στην αρχή κάθε βουλευτικής περιόδου και λειτουργεί καθ'όλη τη διάρκεια αυτής, περιλαμβανομένου και του μεταξύ των συνόδων χρόνου. \n" +
            "Διατυπώνει γνώμη για την καταλληλότητα των προτεινομένων προς διορισμό ή επαναδιορισμό ή ανανέωση θητείας σε θέσεις προέδρου ή διευθύνοντος συμβούλου δημοσίων επιχειρήσεων, τραπεζών, οργανισμών κοινής ωφελείας και φορέων κοινωνικής ασφάλισης. \n" +
            "Μπορεί να καλεί σε ακρόαση οποιοδήποτε από τα προηγούμενα πρόσωπα μετά την πάροδο 6 μηνών από το διορισμό του ή από την προηγούμενη ακρόασή του.</p>\n" +
            "<br />\n" +
            "<h2>Επιτροπές για εθνικά ή γενικότερου ενδιαφέροντος ζητήματα</h2>\n" +
            "Συνιστώνται με απόφαση της Βουλής, μετά από πρόταση της Κυβέρνησης ή του Προέδρου της Βουλής ή των Προέδρων των κοινοβουλευτικών ομάδων, με σκοπό τη μελέτη εθνικών ή γενικότερου ενδιαφέροντος ζητημάτων. Με την απόφαση της σύστασης της επιτροπής η Βουλή προσδιορίζει το αντικείμενο με το οποίο θα ασχοληθεί η επιτροπή και καθορίζει την προθεσμία υποβολής της σχετικής έκθεσης.</p>\n" +
            "<br />\n" +
            "<h2>Εξεταστικές επιτροπές </h2>\n" +
            "Οι εξεταστικές επιτροπές συνιστώνται για την εξέταση ειδικών ζητημάτων δημόσιου ενδιαφέροντος, μετά από πρόταση του ενός πέμπτου του όλου αριθμού των Βουλευτών (60 Βουλευτές) και απόφαση της Ολομέλειας της Βουλής, που λαμβάνεται με την απόλυτη πλειοψηφία των παρόντων, η οποία δεν μπορεί να είναι μικρότερη από τα δύο πέμπτα του όλου αριθμού των Βουλευτών (120 ψήφοι). Αν το θέμα αφορά στην εξωτερική πολιτική ή την εθνική άμυνα, απαιτείται η απόλυτη πλειοψηφία του όλου αριθμού των Βουλευτών (151 Βουλευτές). \n" +
            "Η απόφαση της Βουλής καθορίζει την προθεσμία υποβολής του πορίσματος της επιτροπής. \n" +
            "Οι εξεταστικές επιτροπές έχουν όλες τις αρμοδιότητες των ανακριτικών αρχών και του εισαγγελέα πλημμελειοδικών.</p>\n" +
            "<br />\n" +
            "<h2>Ειδικές κοινοβουλευτικές επιτροπές για τη διεξαγωγή προκαταρκτικής εξέτασης </h2>\n" +
            "Αν η Βουλή αποφασίσει προκαταρκτική εξέταση, ορίζει από τα μέλη της δωδεκαμελή επιτροπή για τη διενέργειά της. Συγχρόνως ορίζει και την προθεσμία μέσα στην οποία η επιτροπή οφείλει να υποβάλει το πόρισμά της και το σχετικό αποδεικτικό υλικό. \n" +
            "Η επιτροπή έχει όλες τις αρμοδιότητες εισαγγελέα πλημμελειοδικών, όταν αυτός διενεργεί προκαταρκτική εξέταση. \n" +
            "Το πόρισμα της επιτροπής πρέπει να είναι αιτιολογημένο και να περιέχει σαφή πρόταση για την άσκηση δίωξης.</p>\n" +
            "<br />\n" +
            "<h2>Επιτροπή Αναθεώρησης του Συντάγματος</h2>\n" +
            "Συνιστάται από τον Πρόεδρο της Βουλής μετά την υποβολή, από 50 τουλάχιστον Βουλευτές, προτάσεων για την αναθεώρηση του Συντάγματος, οι οποίες παραπέμπονται σ' αυτήν για εξέταση. \n" +
            "Η Βουλή, με απόφασή της, που λαμβάνεται μετά από πρόταση του Προέδρου της, ορίζει προθεσμία για την υποβολή της έκθεσης της επιτροπής, η οποία μπορεί να παρατείνεται με νεότερες αποφάσεις της Βουλής.</p>\n" +
            "<br />\n" +
            "<br />\n";

    public EpitropesFragment() {
        // Required empty public constructor
    }

    @Override
    public void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
    }

    @Override
    public View onCreateView(LayoutInflater inflater, ViewGroup container,
                             Bundle savedInstanceState) {
        View view = inflater.inflate(R.layout.fragment_keimena, container, false);

        TextView tv = (TextView) view.findViewById(R.id.textThesmos);
        tv.setText(Html.fromHtml(htmlText));
        // Inflate the layout for this fragment
        return view;
    }

}