package gr.sextreme.vouli;

import android.os.Bundle;
import android.support.v4.app.Fragment;
import android.text.Html;
import android.view.LayoutInflater;
import android.view.View;
import android.view.ViewGroup;
import android.widget.TextView;

import gr.sextreme.R;

public class ProedreioFragment extends Fragment {

    private final String htmlText = "(άρθρα 6 – 12 του ΚτΒ)\n" +
            "<br />\n" +
            "<br />\n" +
            "Το Προεδρείο της Βουλής των Ελλήνων αποτελείται από:\n" +
            "<br />\n" +
            "• <strong>τον Πρόεδρο της Βουλής</strong></div>\n\n" +
            "<br />\n" +
            "• <strong>επτά (7) Αντιπροέδρους</strong></div>\n\n" +
            "<br />\n" +
            "• <strong>τρεις (3) Κοσμήτορες</strong></div>\n\n" +
            "<br />\n" +
            "• <strong>έξι (6) Γραμματείς</strong>\n\n" +
            "<br />\n" +
            "<br />\n" +
            "Κύριο χαρακτηριστικό είναι η διακομματική του σύνθεση. Έτσι, ο πρώτος, ο δεύτερος και ο τρίτος Αντιπρόεδρος, δύο Κοσμήτορες και τέσσερις Γραμματείς προέρχονται από τη συμπολίτευση, ο τέταρτος Αντιπρόεδρος, ένας Κοσμήτορας και ένας Γραμματέας προέρχονται υποχρεωτικά από την Αξιωματική Αντιπολίτευση, ο πέμπτος Αντιπρόεδρος και ένας Γραμματέας από τη δεύτερη σε δύναμη Κοινοβουλευτική Ομάδα της Αντιπολίτευσης, ο έκτος Αντιπρόεδρος από την τρίτη σε δύναμη Κοινοβουλευτική Ομάδα της Αντιπολίτευσης και ο έβδομος Αντιπρόεδρος από την τέταρτη σε δύναμη Κοινοβουλευτική Ομάδα της Αντιπολίτευσης.</div>\n\n" +
            "<br />\n" +
            "<br />\n" +
            "Τα μέλη του Προεδρείου είναι υποχρεωτικά Βουλευτές, ενώ η ιδιότητα μέλους του Προεδρείου είναι ασυμβίβαστη με αυτή του Υπουργού ή του Υφυπουργού. Αν ένα μέλoς τoυ Πρoεδρείoυ αποδεχθεί θέση Yπoυργoύ ή Yφυπoυργoύ, θεωρείται πως παραιτείται αυτοδικαίως από μέλος του Προεδρείου της Βουλής.</div>\n\n" +
            "<br />\n" +
            "<br />\n" +
            "Ο Πρόεδρος της Βουλής και οι επτά Αντιπρόεδροι εκλέγονται στην αρχή κάθε περιόδου και για όλη τη διάρκειά της. Η θητεία των Κοσμητόρων και των Γραμματέων διαρκεί όσο και η τακτική Σύνοδος της Βουλής των Ελλήνων για την οποία εκλέχθηκαν.</div>\n\n" +
            "<br />\n" +
            "<h2>Διάσκεψη Προέδρων</h2>\n" +
            "(άρθρα 13 & 14 του ΚτΒ)\n" +
            "<br />\n" +
            "<br />\n" +
            "Είναι το διακομματικό συλλογικό όργανο που συστάθηκε με τον Κανονισμό της Βουλής του 1987 και αναγνωρίσθηκε συνταγματικά με την αναθεώρηση του 2001. Αποστολή του είναι η καλύτερη οργάνωση των εργασιών της Βουλής μέσα από τη συνεργασία του Προεδρείου και όλων των κοινοβουλευτικών ομάδων.\n\n" +
            "<br />\n" +
            "Αποτελείται από τον Πρόεδρο και τους Αντιπροέδρους της Βουλής, τους διατελέσαντες Προέδρους της Βουλής εφόσον έχουν εκλεγεί Βουλευτές, τους Προέδρους των Διαρκών Επιτροπών, τον Πρόεδρο της Επιτροπής Θεσμών και Διαφάνειας, τους Προέδρους των Κοινοβουλευτικών Ομάδων και έναν εκπρόσωπο των ανεξάρτητων Βουλευτών (εφόσον οι τελευταίοι είναι τουλάχιστον πέντε).\n\n" +
            "<br />\n" +
            "Η Διάσκεψη των Προέδρων συνέρχεται σε τακτική συνεδρίαση μία φορά την εβδομάδα. Αποστολή της είναι να εξετάζει την ημερήσια διάταξη των εργασιών της Βουλής, να οργανώνει τη διεξαγωγή του νομοθετικού έργου, να αποφασίζει για τη διεξαγωγή οργανωμένης συζήτησης και να ασκεί κάθε άλλη αρμοδιότητα που της αναγνωρίζει το Σύνταγμα ή ο Κανονισμός της Βουλής.\n\n" +
            "<br />\n" +
            "Η Διάσκεψη των Προέδρων έχει την αρμοδιότητα να επιλέγει, με ομοφωνία ή με πλειοψηφία των 4/5 των μελών της, τα μέλη των Ανεξάρτητων Αρχών που προβλέπονται από το Σύνταγμα, ενώ ασκεί επίσης, την κοινοβουλευτική τους εποπτεία.\n" +
            "<br />\n" +
            "Επίσης, με ομοφωνία ή με πλειοψηφία των 4/5 των μελών της, επιλέγει τον πρόεδρο, τον αντιπρόεδρο και δύο μέλη της Ελληνικής Στατιστικής Αρχής και εκφράζει γνώμη, μετά από ακρόαση των υποψηφίων, για την επιλογή δικαστικών λειτουργών στις κορυφαίες θέσεις της Δικαιοσύνης.\n" +
            "<br />\n" +
            "<br />\n";


    public ProedreioFragment() {
        // Required empty public constructor
    }

    @Override
    public void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
    }

    @Override
    public View onCreateView(LayoutInflater inflater, ViewGroup container,
                             Bundle savedInstanceState) {
        View view = inflater.inflate(R.layout.fragment_keimena, container, false);

        TextView tv = (TextView) view.findViewById(R.id.textThesmos);
        tv.setText(Html.fromHtml(htmlText));
        // Inflate the layout for this fragment
        return view;
    }

}